synthetic/loadtest_synthetic.yml
config:
  target: 'https://dev-accelerated-store-demo.pantheonsite.io'
  #tls: {
  #  "rejectUnauthorized": false
  #}
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 1
  payload:
    path: "../loadtest_payload.csv"
    fields:
      - "name"
      - "product_id"
      - "quantity"
      - "authHash"
  processor: "./loadtest_synthetic.js"

scenarios:
  - flow:
    - function: "runTest"